chomp/CHAMP_Accept_Doc.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rps="http://www.northgate-is.com/rps">
   <soapenv:Header/>
   <soapenv:Body>
      <rps:DocReceivedRequest>
         <rps:Document>
            <rps:Source>DMS</rps:Source>
            <rps:DocReference>12345693</rps:DocReference>
            <rps:FilePlanLocation>UNALLOCATED</rps:FilePlanLocation>
            <rps:WebDavURL>http://google.com</rps:WebDavURL>
         </rps:Document>
         <rps:RPSAdditionalInfo>
            <!--Optional:-->
            <rps:RPSDocId>0</rps:RPSDocId>
            <!--Optional:-->
            <rps:RPSDocumentType>RP1</rps:RPSDocumentType>
         </rps:RPSAdditionalInfo>
      </rps:DocReceivedRequest>
   </soapenv:Body>
</soapenv:Envelope>